Netology/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Netology/src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
</mdclass:Catalog>

Netology/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)     
	
	Слово = СокрЛП(Объект.Наименование);
	Пробел = Найти(Слово, " ");
	Если Пробел > 0 Тогда
		ИскомаяАббревиатура = Лев(Слово, Пробел-1);
	Иначе
		ИскомаяАббревиатура = Слово;
	КонецЕсли;
	
	ОПФАббревиатуры = Новый Структура;
	ОПФАббревиатуры.Вставить("ИП", "Индивидуальный предприниматель");
	ОПФАббревиатуры.Вставить("ООО", "Общество с ограниченной ответственностью");
	ОПФАббревиатуры.Вставить("АО", "Акционерное общество");
	ОПФАббревиатуры.Вставить("НКО", "Некоммерческая организация");
	
	ПолноеНаименование = СтрЗаменить(Объект.Наименование, ИскомаяАббревиатура, ОПФАббревиатуры[ИскомаяАббревиатура]);
	Объект.ПолноеНаименование = ПолноеНаименование;
КонецПроцедуры


&НаСервере
Процедура СписокКонтактныхЛицНаСервере(Контрагент)
	
	Если Контрагент.Наименование = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ВыборкаКонтактныхЛиц = Справочники.КонтактныеЛица.Выбрать( , Контрагент);
	Пока ВыборкаКонтактныхЛиц.Следующий()Цикл
		 ИмяКонтакта = ВыборкаКонтактныхЛиц.Наименование;
		 Должность = ВыборкаКонтактныхЛиц.Должность;
		 Телефон = ВыборкаКонтактныхЛиц.Телефон;
		 Сообщить(СтрШаблон("Имя контактного лица: %1 Должность: %2 Телефон: %3.", ИмяКонтакта, Должность, Телефон)); 
	КонецЦикла;		
	
КонецПроцедуры


&НаКлиенте
Процедура СписокКонтактныхЛиц(Команда)
	
	СписокКонтактныхЛицНаСервере(Объект.Ссылка);
	
КонецПроцедуры
